[
   {
      "Ingredients": [
         "2 fennel bulbs, thinly sliced",
         "1 large bunch parsley, tender stems and leaves",
         "¼ cup fresh lemon juice, plus more to taste",
         "Kosher salt and freshly ground black pepper",
         "Olive oil, for drizzling",
         "Fresh horseradish, for grating"
      ],
      "name": "Parsley Salad With Fennel and Horseradish",
      "steps": [
         "Toss fennel and parsley together in a medium bowl. Add lemon juice, season with salt and pepper, and toss to coat. Season again with salt, pepper and more lemon juice if you like. (It should be fairly lemony.)",
         "Drizzle with olive oil, toss to coat and grate a bit of fresh horseradish over everything, gently tossing to distribute the horseradish. (Doing it this way prevents clumping.) Transfer to a serving bowl and grate more horseradish over before serving."
      ],
      "when_to_cock": "This salad is an obvious nod to the Seder plate, including both parsley (karpas) and fresh horseradish (maror, or bitter herbs), except it’s less ceremonial and more just a very delicious salad. I love, love parsley and think a well-seasoned bowl of it is something that most tables can benefit from, especially if those tables include braised pots of red meat. While parsley and fennel can be prepared ahead of time, the salad itself is best dressed right before you eat."
   },
   {
      "Ingredients": [
         "1cup/150 grams walnut halves",
         "2large or 3 small firm, crisp sweet apples (1 pound), such as Fuji or Gala, peeled, cored and diced in ¼-inch pieces",
         "5tablespoons sweet Passover wine, such as Manischewitz, or ruby port",
         "1tablespoon fresh lemon juice",
         "½tablespoon honey, plus more to taste",
         "½teaspoon ground cinnamon, plus more to taste",
         "Pinch of salt"
      ],
      "name": "Apple and Walnut Haroseth",
      "steps": [
         "Heat oven to 325 degrees. Toast walnuts on a rimmed baking sheet until fragrant and golden-brown, about 10 minutes. Cool on a wire rack.",
         "Finely chop the nuts and place in a large bowl. Add remaining ingredients and toss to coat. Let sit for at least 30 minutes before serving. Taste and add more honey and cinnamon, if you’d like."
      ],
      "when_to_cock": "This is a ceremonial part of the Passover Seder."
   },
   {
      "Ingredients": [
         "4 pounds russet potatoes (about 5 to 7 potatoes), peeled",
         "1 large yellow onion",
         "6 large eggs",
         "10 tablespoons chicken fat, melted, or use vegetable oil",
         "Kosher salt and freshly ground black pepper",
         "⅓ cup finely chopped chives, for serving",
         "Flaky sea salt, for serving"
      ],
      "name": "Crispy Potato Kugel",
      "steps": [
         "Heat oven to 425 degrees. Grate potatoes and onion.",
         "Squeeze water from potatoes and onions.",
         "Add eggs and 6 tablespoons chicken fat to the potatoes, and season with salt and pepper, mixing well. Heat another 2 tablespoons fat in a cast-iron skillet.",
         "Cook the potatoes, rotating the skillet occasionally to promote even browning, until it’s golden brown on the edges and up the sides, 10 to 12 minutes.",
         "Drizzle the top of the potatoes with the remaining 2 tablespoons fat and place in the oven. Bake until the top of the kugel is deeply golden brown, the edges are wispy and crispy, and the potatoes are completely and totally tender and cooked through, 45 to 50 minutes.",
         "Remove from oven and top with more pepper, chives and flaky sea salt. Slice and serve warm."
      ],
      "when_to_cock": "This is suitable as a side dish, particularly for Jewish holidays like Passover, or as a comforting savory casserole."
   },
   {
      "Ingredients": [
         "50g/1¾oz tamarind paste",
         "4 tbsp soy sauce",
         "4 tbsp hot water, from a recently boiled kettle",
         "2 tbsp sunflower oil",
         "1 tbsp runny honey",
         "750g/1lb 10oz (whole piece) bavette steak"
      ],
      "name": "Tamarind-marinated bavette steak",
      "steps": [
         "Dissolve tamarind paste, soy sauce, and hot water in a saucepan.",
         "Whisk in oil and honey, and let cool.",
         "Marinate bavette steak in the mixture overnight or for 1 day in a resealable bag.",
         "Bring to room temperature.",
         "Sear steak on a hot, ridged griddle for 2 minutes a side.",
         "Wrap in foil and let rest for 5 minutes.",
         "Carve thinly against the grain."
      ],
      "when_to_cock": "Anytime, but also for New Year's dinner party"
   }
]